app/Controllers/Cliente.php

    public function index()
    {
        $this->data['titulo'] = 'Início';
        $this->data['clientes'] =  $this->clienteModel->getClienteCivilDocumento()->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `clientes`
JOIN `estadocivil` ON `estadocivil`.`estado_civil_id` = `clientes`.`estado_civil`
JOIN `tipodocumento` ON `tipodocumento`.`documento_id` = `clientes`.`tipo_documento`
WHERE `clientes`.`deleted_at` IS NULL