app/Models/ClienteModel.php

SELECT *
FROM `clientes`
JOIN `estadocivil` ON `estadocivil`.`estado_civil_id` = `clientes`.`estado_civil`
JOIN `tipodocumento` ON `tipodocumento`.`documento_id` = `clientes`.`tipo_documento`
WHERE `cliente_id` = '142'
---
    public function getClienteCivilDocumento($id = false)
    {
        if ($id === false)
            return $this->join('estadocivil', 'estadocivil.estado_civil_id = clientes.estado_civil')
                ->join('tipodocumento', 'tipodocumento.documento_id = clientes.tipo_documento')
                ->orderBy('nome', 'ASC');
        else {
            return $this->join('estadocivil', 'estadocivil.estado_civil_id = clientes.estado_civil')
                ->join('tipodocumento', 'tipodocumento.documento_id = clientes.tipo_documento')
                ->getwhere(['cliente_id' => $id])
                ->getResultArray()[0];