app/Models/TelefoneModel.php

    public function getTelefoneByCliente($id)
    {
        return $this->asArray()
            ->where(['cliente_id' => $id])
            ->first();
---
SELECT *
FROM `telefones`
WHERE `cliente_id` = '142'
 LIMIT 1